In [3]:
import pandas as pd
dict={1:"one",2:"two",3:"three"}
a=pd.Series(dict)
print(a)

1      one
2      two
3    three
dtype: object

In [4]:
a.describe()

count       3
unique      3
top       one
freq        1
dtype: object

In [5]:
import pandas as pd
stud=pd.read_csv("student.csv")
print(stud)

    S.NO name  marks
0      1    a     10
1      2    b      9
2      3    c      8
3      4    d      8
4      5    e      9
5      6    f     10
6      7    g      7
7      8    h      6
8      9    i     10
9     10    j      7
10    11    k      8

In [6]:
stud.describe()

            S.NO      marks
count  11.000000  11.000000
mean    6.000000   8.363636
std     3.316625   1.361817
min     1.000000   6.000000
25%     3.500000   7.500000
50%     6.000000   8.000000
75%     8.500000   9.500000
max    11.000000  10.000000

In [7]:
stud.head()

   S.NO name  marks
0     1    a     10
1     2    b      9
2     3    c      8
3     4    d      8
4     5    e      9

In [8]:
stud.tail()

    S.NO name  marks
6      7    g      7
7      8    h      6
8      9    i     10
9     10    j      7
10    11    k      8

In [9]:
stud.head(7)

   S.NO name  marks
0     1    a     10
1     2    b      9
2     3    c      8
3     4    d      8
4     5    e      9
5     6    f     10
6     7    g      7

In [10]:
stud.tail(10)

    S.NO name  marks
1      2    b      9
2      3    c      8
3      4    d      8
4      5    e      9
5      6    f     10
6      7    g      7
7      8    h      6
8      9    i     10
9     10    j      7
10    11    k      8

In [12]:
print(type(stud))

<class 'pandas.core.frame.DataFrame'>

In [13]:
stud.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   S.NO    11 non-null     int64
 1   name    11 non-null     object
 2   marks   11 non-null     int64
dtypes: int64(2), object(1)
memory usage: 392.0+ bytes

In [14]:
type(stud)

pandas.core.frame.DataFrame

In [16]:
stud["marks"].max()

10

In [17]:
stud["marks"]>7

0      True
1      True
2      True
3      True
4      True
5      True
6     False
7     False
8      True
9     False
10     True
Name: marks, dtype: bool

In [18]:
stud[stud["marks"]>7]

    S.NO name  marks
0      1    a     10
1      2    b      9
2      3    c      8
3      4    d      8
4      5    e      9
5      6    f     10
8      9    i     10
10    11    k      8